[
    {
		"time": "2021-01-11",
		"text": "Learning is the eternal gift. Every single day provides us all with so many opportunities to learn and grow. Life is one big adventure in so many ways and when we adopt a curious and open mindset it’s amazing what we can discover. I certainly know from personal experience that curiosity has helped me to be more resilient in challenging times, and life is never boring for a curious person."
	},
    {
		"time": "2021-01-12",
        "text": "Even in the midst of uncertainty, it’s important to take time to pause. We can use this time to reflect on our path in life and to develop our curiosity, which ultimately is the key to lifelong learning."
	},
    {
		"time": "2021-01-13",
        "text": "Blessed are the curious for they shall have adventures."
	},
    {
		"time": "2021-01-14",
		"text": "In many ways, curiosity is the catalyst of innovation. Curious people have an ongoing, intrinsic interest in both their inner experience and the world around them. Curiosity is also the engine of intellectual achievement and those who are more interested in a topic will learn faster and prime the brain better for learning. It is also associated with high performance in both academic and work settings and there is an increasing amount of evidence that suggests that the more you learn, the more you want to learn."
	},
    {
		"time": "2021-01-15",
		"text": "Curious minds are active minds, and active minds become smart minds. Curiosity is associated with intelligence, creativity and problem-solving ability. Curious people cultivate interesting and creative environments for themselves as they seek out new experiences and are open to exploring new ideas and possibilities."
	},
    {
		"time": "2021-01-16",
		"text": "Everyone possesses curiosity to some degree, although people will differ according to the depth and strength of their curiosity and their willingness to act on it. In this article, I’ll offer some suggestions to help you become more curious."
	},
    {
		"time": "2021-01-17",
		"text": "Globalisation means that we now work and share our lives with people from so many different backgrounds. We are also working with people across a wide range of age groups. This can be so enlightening and educational and will help you to broaden your perspective by listening and learning from others. Being curious about differences will help you to expand your mind and expose you to other viewpoints, values and beliefs."
	}
	
]
